/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Gulp - предоставляет функционал для работы с  Gulp
import gulp from "gulp";

// 2. Модуль BrowserSync - предоставляет функционал для работы с локальным сервером
import browserSync from "browser-sync";

// 3. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам
import { path } from "../config/path.js";

/* <================================================================================================================> */
/* <==================================== РЕАЛИЗАЦИЯ ЗАДАЧИ КОПИРОВАНИЯ ФАЙЛОВ ======================================> */
/* <================================================================================================================> */

// Функция копирует все файлы из папки с исходниками в папку с результатом:
export const copyFiles = () => {
    return gulp.src(path.src.files)             // Считываем из папки с исходниками необходимые файлы
        .pipe(gulp.dest(path.build.files));     // Записываем необходимые файлы в папку с результатом
};