/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Gulp - предоставляет функционал для работы с  Gulp
import gulp from "gulp";

// 2. Модуль Newer - предоставляет информацию об обновлении картинок:
import newer from "gulp-newer";

// 3. Модуль BrowserSync - предоставляет функционал для работы с локальным сервером:
import browserSync from "browser-sync";

// 4. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам
import { path } from "../config/path.js";

/* <================================================================================================================> */
/* <================================== РЕАЛИЗАЦИЯ ЗАДАЧИ  ===================================> */
/* <================================================================================================================> */

// Функция копирует все изображения из папки с исходниками в папку с результатом:
export const copyImages = () => {
    return gulp.src(path.src.images)            // Считываем из папки с исходниками необходимые изображения    
        .pipe(newer(path.build.images))         // Вычисляем изображения, которые были изменены
        .pipe(gulp.dest(path.build.images));    // Записываем необходимые изображения в папку с результатом
};