/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль BrowserSync - предоставляет функционал для работы с локальным сервером:
import browserSync from "browser-sync";

// 2. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам
import { path } from "../config/path.js";

/* <================================================================================================================> */
/* <======================================= РЕАЛИЗАЦИЯ ЛОКАЛЬНОГО СЕРВЕРА ==========================================> */
/* <================================================================================================================> */

export const server = () => {
    browserSync.init({                      // Запускаем сервер
        server: {
            baseDir: `${path.build.html}`   // Базовая папка, от куда будут запущены файлы
        },
        notify: false,                      // Отключаем сообщения в браузере
        port: 3000                          // Выбираем порт
    });
};