/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Path - предоставляет функционал для работы с путями:
import * as nodePath from "path";

/* <================================================================================================================> */
/* <============================================== ОПРЕДЕЛЕНИЕ ПУТЕЙ ===============================================> */
/* <================================================================================================================> */

const rootFolder = nodePath.basename(nodePath.resolve());   // Имя папки проекта

const buildFolder = "./dist";                               // Путь к папке с результатом
const srcFolder = "./src";                                  // Путь к папке с исходниками

export const path = {                                       // Пути к необходимым файлам/папкам
    build: {                                                // Пути, по которым будут размещены результирующие файлы:
        html: `${buildFolder}/`,                          // Html файлы
        css: `${buildFolder}/css/`,                             // Css файлы
        js: `${buildFolder}/js/`,                               // JS файлы
        images: `${buildFolder}/img/`,                          // Картинки
        fonts: `${buildFolder}/fonts/`,                         // Шрифты
        files: `${buildFolder}/files/`                          // Иные файлы
    },
    src: {                                                  // Пути, из которых будут извлечены результирующие файлы:
        pug: `${srcFolder}/pug/pages/*.pug`,                    // PUG файлы
        sass: `${srcFolder}/sass/style.sass`,                   // Sass файлы
        js: `${srcFolder}/js/app.js`,                           // JS файлы
        images: `${srcFolder}/img/**/*.{jpg,jpeg,png,svg}`,     // Картинки
        files: `${srcFolder}/files/**/*.*`                      // Иные файлы
    },
    watch: {                                                // Пути к файлам, за которыми необходимо наблюдать:
        pug: [`${srcFolder}/**/*.pug`, `!${srcFolder}/pug/include-blocks.pug`],     // Html файлы
        sass: [`${srcFolder}/**/*.sass`, `!${srcFolder}/sass/import-blocks.sass`],  // Sass файлы
        js: `${srcFolder}/**/*.js`,                                                 // JS файлы
        images: `${srcFolder}/img/**/*.{jpg,jpeg,png,svg}`,                         // Картинки
        files: `${srcFolder}/files/**/*.*`                                          // Иные файлы
    },
    clean: buildFolder,                                     // Путь к папке, которую необходимо отчистить
    buildFolder: buildFolder,                               // Путь к папке с результатом
    srcFolder: srcFolder,                                   // Путь к папке с исходниками
    rootFolder: rootFolder                                  // Путь к папке проекта
};