/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Gulp - предоставляет функционал для работы с  Gulp
import gulp from "gulp";

// 2. Модуль BrowserSync - предоставляет функционал для работы с локальным сервером:
import browserSync from "browser-sync";

// 3. Модуль GulpPug - преобразует pug-файлы в html-файлы
import GulpPug from "gulp-pug";

// 4. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам
import { path } from "../../config/path.js";

/* <================================================================================================================> */
/* <================================ РЕАЛИЗАЦИЯ ЗАДАЧИ КОНВЕРТИРОВАНИЯ PUG В HTML ==================================> */
/* <================================================================================================================> */

// Функция конвертирует pug-файлы в html-файлы и переносит их в папку с результатом:
export const pugConversion = () => {
    return gulp.src(path.src.pug)           // Считываем из папки с исходниками необходимые pug-файл
        .pipe(GulpPug({pretty: true}))      // Преобразование pug-файлов в html-файлы
        .pipe(gulp.dest(path.build.html));  // Запись необходимых html-файлов в папку с результатом
};